Revit 2016 API
BuiltInFailures.SketchFailures.BentFabricSheetLinesOverlapOrIntersect Property
 Bend profile contains an overlap or intersects segments. Cannot create a bent fabric sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public static FailureDefinitionId BentFabricSheetLinesOverlapOrIntersect { get; }
Visual Basic
Public Shared ReadOnly Property BentFabricSheetLinesOverlapOrIntersect As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BentFabricSheetLinesOverlapOrIntersect {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace